{"1": {"Description": "Driver's Demand Engine - Percent Torque", "Unit": "%", "Details": "The requested torque output of the engine by the driver. It is based on input from the following requestors external to the powertrain: operator (via the accelerator pedal), cruise control and/or road speed limit governor. Dynamic commands from internal powertrain functions such as smoke control, low- and high-speed engine governing; ASR and shift control are excluded from this calculation. The data is transmitted in indicated torque as a percent of the reference engine torque. See PGN 65251 for the engine configuration message. Several status bits are defined separately to indicate the request which is currently being honored. This parameter may be used for shift scheduling."}, "2": {"Description": "Engine Speed", "Unit": "rpm", "Details": "Actual engine speed which is calculated over a minimum crankshaft angle of 720 degrees divided by the number of cylinders."}, "3": {"Description": "Engine Intake Air Mass Flow Rate", "Unit": "kg/h", "Details": "Mass flow rate of fresh air entering the engine air intake, before any EGR mixer, if used.  Flow rate of fresh air conducted to the engine cylinders to support combustion."}, "4": {"Description": "Engine Exhaust Gas Recirculation 1 Mass Flow Rate", "Unit": "kg/h", "Details": "Flow rate of gas through the EGR system. Flow rate of the exhaust gas being recirculated into the combustion air."}, "5": {"Description": "Aftertreatment 1 Diesel Particulate Filter Intake Pressure", "Unit": "kPa", "Details": "This parameter indicates the diesel particulate filter intake gage pressure 1 (bank 1)."}, "6": {"Description": "Aftertreatment 1 Diesel Particulate Filter Outlet Pressure", "Unit": "kPa", "Details": "This parameter indicates the diesel particulate filter outlet gage pressure 1 (bank 1)."}, "7": {"Description": "Aftertreatment 1 Outlet NOx 1", "Unit": "ppm", "Details": "The amount of combined NO and NO2 in the exhaust exiting the aftertreatment system measured by a NOx sensor at the aftertreatment outlet, represented in NOx molecule parts per million non-NOx molecules in exhaust bank 1.\n\nSPN 3226 shall display the raw, uncorrected NOx sensor signal. 2016 MY and later engines with NOx sensors may be required to output a 'corrected' NOx sensor signal (see SPN 7351) in addition to the raw NOx sensor signal output using SPN 3226.\n\nA value of 0xFB00 shall be provided when ambient or engine operating conditions do not permit the sensor to operate in data collection mode."}, "8": {"Description": "Engine Exhaust Gas Recirculation 1 Valve Position", "Unit": "%", "Details": "The position of the exhaust gas recirculation valve expressed as a percentage of full travel. Zero percent means the valve is closed and no exhaust gas is flowing into the intake air stream. One hundred percent means the valve is fully opened."}, "9": {"Description": "Aftertreatment 1 Diesel Exhaust Fluid Tank Temperature 1", "Unit": "C", "Details": "Temperature of the diesel exhaust fluid in the storage tank."}, "10": {"Description": "Engine Turbocharger 1 Speed", "Unit": "rpm", "Details": "Rotational velocity of rotor in the turbocharger."}, "11": {"Description": "Engine Exhaust Gas Recirculation 1 Differential Pressure", "Unit": "kPa", "Details": "Differential pressure across the Exhaust Gas Recirculation (EGR) system"}, "12": {"Description": "Engine Oil Temperature 1", "Unit": "C", "Details": "Temperature of the engine lubricant.\n\nNote:  If there is only one engine oil temperature measurement, this SPN should be used.  This is the SPN that is typically displayed on an on-highway truck instrument cluster.\n\nSee also SPNs 1135 and 5925 for additional engine oil temperature measurements."}, "13": {"Description": "Engine Coolant Temperature", "Unit": "C", "Details": "Temperature of liquid found in engine cooling system."}, "14": {"Description": "Engine Fuel Delivery Pressure", "Unit": "kPa", "Details": "Gage pressure of fuel in system as delivered from supply pump to the injection pump.  See SPN 7469 for alternate resolution.\n\nSee also SPN 5578 for Fuel Delivery Absolute Pressure."}, "15": {"Description": "Engine Oil Pressure", "Unit": "kPa", "Details": "Gage pressure of oil in engine lubrication system as provided by oil pump.  See SPN 7468 for alternate resolution."}, "16": {"Description": "Wheel-Based Vehicle Speed", "Unit": "km/h", "Details": "Speed of the vehicle as calculated from wheel or tailshaft speed."}, "17": {"Description": "Aftertreatment 1 Diesel Particulate Filter Intermediate Temperature", "Unit": "C", "Details": "Temperature of engine combustion byproducts at a mid-point in the diesel particulate filter in exhaust bank 1."}, "18": {"Description": "Aftertreatment 1 Diesel Particulate Filter Differential Pressure", "Unit": "kPa", "Details": "Exhaust differential pressure measured between the intake and exhaust of a diesel particulate filter in exhaust bank 1."}, "19": {"Description": "Aftertreatment 1 Diesel Particulate Filter Outlet Temperature", "Unit": "C", "Details": "Temperature of engine combustion byproducts leaving the diesel particulate filter exhaust in exhaust bank 1."}, "20": {"Description": "Aftertreatment 1 Exhaust Temperature 1", "Unit": "C", "Details": "The reading from the exhaust temperature sensor located farthest upstream in the aftertreatment system in exhaust bank 1."}, "21": {"Description": "Aftertreatment 1 Diesel Particulate Filter Intake Temperature", "Unit": "C", "Details": "Temperature of engine combustion byproducts entering the diesel particulate filter in exhaust bank 1."}, "22": {"Description": "Ambient Air Temperature", "Unit": "C", "Details": "Temperature of air surrounding vehicle."}, "23": {"Description": "Engine Exhaust Temperature", "Unit": "C", "Details": "Temperature of combustion byproducts leaving the engine.  See SPNs 2433, 2434, 5969 and 5970 for engines with more than one exhaust temperature measurement."}, "24": {"Description": "Engine Intake Air Pressure", "Unit": "kPa", "Details": "Absolute air pressure at input port to intake manifold or air box."}, "25": {"Description": "Aftertreatment Diesel Particulate Filter Active Regeneration Status", "Unit": "bit", "Details": "Indicates the state of diesel particulate filter active regeneration.  This is an aggregate of bank 1 and bank 2.  It is a system status and not individual bank status."}, "26": {"Description": "Aftertreatment 1 SCR Intake Temperature", "Unit": "C", "Details": "Temperature of engine combustion byproducts entering the SCR in exhaust bank 1."}, "27": {"Description": "Aftertreatment 1 SCR Outlet Temperature", "Unit": "C", "Details": "Temperature of engine combustion byproducts leaving the SCR outlet in exhaust bank 1."}}